###############################################################################
# Created by write_sdc
###############################################################################
current_design dot_product
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 4.5000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[32]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[33]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[34]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[35]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[36]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[37]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[38]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[39]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[40]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[41]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[42]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[43]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[44]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[45]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[46]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[47]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[48]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[49]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[50]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[51]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[52]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[53]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[54]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[55]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[56]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[57]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[58]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[59]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[60]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[61]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[62]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[63]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {A[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[0]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[10]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[11]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[12]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[13]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[14]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[15]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[16]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[17]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[18]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[19]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[1]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[20]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[21]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[22]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[23]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[24]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[25]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[26]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[27]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[28]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[29]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[2]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[30]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[31]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[32]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[33]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[34]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[35]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[36]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[37]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[38]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[39]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[3]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[40]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[41]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[42]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[43]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[44]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[45]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[46]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[47]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[48]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[49]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[4]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[50]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[51]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[52]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[53]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[54]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[55]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[56]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[57]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[58]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[59]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[5]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[60]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[61]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[62]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[63]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[6]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[7]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[8]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {B[9]}]
set_input_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[0]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[10]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[11]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[12]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[13]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[14]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[15]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[16]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[17]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[18]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[19]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[1]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[2]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[3]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[4]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[5]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[6]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[7]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[8]}]
set_output_delay 0.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dot_out[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
