current_design <MODULE_NAME>

set clk_name      <CLOCK_NAME>
set clk_port_name <CLOCK_PORT>
set clk_period    <PERIOD_NS>
set clk_io_pct 0

set clk_port [get_ports $clk_port_name]

create_clock -name $clk_name -period $clk_period $clk_port

set non_clock_inputs [lsearch -inline -all -not -exact [all_inputs] $clk_port]

set_input_delay  [expr $clk_period * $clk_io_pct] -clock $clk_name $non_clock_inputs 
set_output_delay [expr $clk_period * $clk_io_pct] -clock $clk_name [all_outputs]